In [2]:
import pandas as pd
import numpy as np

# Data Source 1: OECD

In [3]:
oecd_data=pd.read_csv('/Users/mikel/Documents/Projects/chameleon-pricing/oecd_data.csv')

In [4]:
oecd_data=oecd_data.dropna(axis=1)
oecd_data=oecd_data.drop(columns=['SUBJECT', 'MEASURE', 'FREQUENCY', 'INDICATOR'])

# Data Source 2: The World Bank

In [5]:
twb_data = pd.read_csv('/Users/mikel/Documents/Projects/chameleon-pricing/twb_data.csv', sep=",", skiprows=3)

In [6]:
twb_data=twb_data.drop(columns=['Unnamed: 65', 'Indicator Name', 'Indicator Code'])

In [7]:
twb_data=twb_data.dropna(axis=1,how='all')

# Get last PPP

In [8]:
twb_data['last_value'] = twb_data.ffill(axis=1).iloc[:, -1] 
twb_data

,Country Name,Country Code,1990,1991,1992,1993,1994,1995,1996,1997,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,last_value
0,Aruba,ABW,9.451314e-01,9.655218e-01,9.798110e-01,1.007829,1.048954,1.062042,1.077156,1.098135,...,1.317801,1.285141,1.308843,1.362318,1.355045,1.350690,NaN,NaN,NaN,1.35069
1,Afghanistan,AFG,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,17.242264,17.509419,17.035878,17.022520,17.445828,17.205558,17.144309,17.914483,NaN,17.9145
2,Angola,AGO,1.058393e-08,2.112144e-08,1.190553e-07,0.000001,0.000026,0.000497,0.023940,0.045998,...,65.681671,66.019371,65.000671,68.182045,80.778969,92.951721,117.116076,146.167168,NaN,146.167
3,Albania,ALB,2.338549e+00,3.065402e+00,9.979887e+00,21.998489,29.258513,31.477205,35.424557,38.738167,...,43.655000,44.113709,42.893807,42.705831,42.385879,42.255535,42.125796,41.342391,NaN,41.3424
4,Andorra,AND,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AND
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259,Kosovo,XKX,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.330216,0.332721,0.339622,0.339128,0.339378,0.340077,0.335354,0.332390,NaN,0.33239
260,"Yemen, Rep.",YEM,6.107839e+00,6.616785e+00,7.321481e+00,8.323239,9.842986,14.050874,18.871843,21.016099,...,88.792992,93.631317,NaN,NaN,NaN,NaN,NaN,NaN,NaN,93.6313
261,South Africa,ZAF,1.265262e+00,1.415433e+00,1.585498e+00,1.749861,1.877083,2.026311,2.147189,2.279385,...,5.107817,5.295738,5.571891,5.825256,6.159093,6.426701,6.519588,6.652566,NaN,6.65257
262,Zambia,ZMB,9.556399e-03,1.780860e-02,4.623424e-02,0.110046,0.194742,0.249130,0.304221,0.375034,...,2.651491,2.832861,3.064822,3.366482,3.878827,4.192580,4.396237,4.641657,NaN,4.64166
263,Zimbabwe,ZWE,7.439981e-01,6.708873e-01,5.632571e-01,0.529361,0.498103,0.502697,0.538010,0.513663,...,0.549246,0.558424,0.549252,0.539304,0.521862,0.511243,0.525139,0.494348,NaN,0.494348

In [9]:
# Delete rows with all null values in numeric columns
twb_data=twb_data[pd.to_numeric(twb_data['last_value'], errors='coerce').notnull()]

In [10]:
twb_data.head()

,Country Name,Country Code,1990,1991,1992,1993,1994,1995,1996,1997,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,last_value
0,Aruba,ABW,9.451314e-01,9.655218e-01,9.798110e-01,1.007829,1.048954,1.062042,1.077156,1.098135,...,1.317801,1.285141,1.308843,1.362318,1.355045,1.350690,NaN,NaN,NaN,1.35069
1,Afghanistan,AFG,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,17.242264,17.509419,17.035878,17.022520,17.445828,17.205558,17.144309,17.914483,NaN,17.9145
2,Angola,AGO,1.058393e-08,2.112144e-08,1.190553e-07,0.000001,0.000026,0.000497,0.023940,0.045998,...,65.681671,66.019371,65.000671,68.182045,80.778969,92.951721,117.116076,146.167168,NaN,146.167
3,Albania,ALB,2.338549e+00,3.065402e+00,9.979887e+00,21.998489,29.258513,31.477205,35.424557,38.738167,...,43.655000,44.113709,42.893807,42.705831,42.385879,42.255535,42.125796,41.342391,NaN,41.3424
6,United Arab Emirates,ARE,1.167017e+00,1.137996e+00,1.132743e+00,1.120668,1.094358,1.113766,1.156881,1.126440,...,2.177725,2.213316,2.182567,2.187785,2.189752,2.221792,2.346952,2.258503,NaN,2.2585

In [11]:
df1=twb_data[['Country Name', 'last_value']]

In [12]:
df1=df1.rename(columns={'Country Name' : 'Country'})

In [13]:
df1.head()

                Country last_value
0                 Aruba    1.35069
1           Afghanistan    17.9145
2                Angola    146.167
3               Albania    41.3424
6  United Arab Emirates     2.2585

# Get currency codes

In [14]:
currency=pd.read_html('https://docs.1010data.com/1010dataReferenceManual/DataTypesAndFormats/currencyUnitCodes.html')
currency=currency[0]

In [15]:
currency.head()

           Entity        Currency Code Minor Unit
0     AFGHANISTAN         Afghani  AFN          2
1   ÅLAND ISLANDS            Euro  EUR          2
2         ALBANIA             Lek  ALL          2
3         ALGERIA  Algerian Dinar  DZD          2
4  AMERICAN SAMOA       US Dollar  USD          2

In [16]:
currency['Entity']=currency['Entity'].str.lower()
df1['Country']=df1['Country'].str.lower()

In [17]:
currency.Entity=currency.Entity.replace('bolivia, plurinational state of', 'bolivia')
currency.Entity=currency.Entity.replace('venezuela, bolivarian republic of', 'venezuela, rb')

In [18]:
country_currency=df1.merge(currency, left_on='Country', right_on='Entity')

In [19]:
country_currency=country_currency[['Country', 'last_value', 'Currency', 'Code']]

In [20]:
country_currency.head()

                Country last_value       Currency Code
0                 aruba    1.35069  Aruban Florin  AWG
1           afghanistan    17.9145        Afghani  AFN
2                angola    146.167         Kwanza  AOA
3               albania    41.3424            Lek  ALL
4  united arab emirates     2.2585     UAE Dirham  AED

In [21]:
country_currency.to_csv('/Users/mikel/Documents/Projects/chameleon-pricing/country_currency.csv', index=False)